000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO2.
000030*
000040 ENVIRONMENT DIVISION.
000050 INPUT-OUTPUT SECTION.
000060 FILE-CONTROL.
000070   SELECT FILE01 ASSIGN TO './file01.txt'.
000080*
000090 DATA DIVISION.
000100 FILE SECTION.
000110 FD FILE01.
000120 01 FILE01-REC.
000130    03 DATE-YMD.
000140       05 DATE-YMD-YY1 PIC X(02).
000150       05 DATE-YMD-YY2 PIC X(02).
000160       05 DATE-YMD-MM  PIC X(02).
000170       05 DATE-YMD-DD  PIC X(02).
000180    03 DATE-HMS.
000190       05 DATE-HMS-HH  PIC X(02).
000200       05 DATE-HMS-MI  PIC X(02).
000210       05 DATE-HMS-SS  PIC X(02).
000220    03 MESSAGE-BUFF PIC X(66).
000230*
000240 WORKING-STORAGE SECTION.
000250 01 CNT PIC 9(05) VALUE 0.
000260 01 WORK-AREA.
000270    03 WORK-DATE.
000280       05 WORK-DATE-YY PIC X(02).
000290       05 WORK-DATE-MM PIC X(02).
000300       05 WORK-DATE-DD PIC X(02).
000310 PROCEDURE DIVISION.
000320*/* テスト */
000330 DISPLAY 'Hello, World!'
000340 OPEN OUTPUT FILE01
000350 ACCEPT WORK-DATE FROM DATE
000360 IF WORK-DATE-YY > '85' THEN
000370    MOVE '19' TO DATE-YMD-YY1
000380 ELSE
000390    MOVE '20' TO DATE-YMD-YY1
000400 END-IF
000410 MOVE WORK-DATE-YY TO DATE-YMD-YY2
000420 MOVE WORK-DATE-MM TO DATE-YMD-MM
000430 MOVE WORK-DATE-DD TO DATE-YMD-DD
000440*
000450 PERFORM UNTIL CNT = 10
000460    ADD 1 TO CNT
000470    ACCEPT DATE-HMS FROM TIME
000480    MOVE 'HELLO' TO MESSAGE-BUFF
000490    WRITE FILE01-REC
000500 END-PERFORM
000510 CLOSE FILE01
000520 STOP RUN.
