000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO-COBOL.
000030*
000040 PROCEDURE DIVISION.
000050*/* テスト */
000060 DISPLAY 'Hello, World!'.
000070 STOP RUN.
